{
  "main": {
    "name":"Harrison King",
    "occupation":"Fullstack Developer",
    "description":"I live for creativity. Every new technology I learn, every new job I take, I do so to better express that creativity. Let's make something incredible together",
    "image":"profilepic.jpg",
    "bio":"I specialize in Javascript, React, Express, mongoDB and Mongoose. I have put hundreds of hours into building web apps using NodeJS and GitHub. I’ve worked with partners on these apps while using the principles of Agile development.",
    "contactmessage":"Don't hesitate to contact me. I'd love to discuss any opportunities.",
    "email": "harrison@harrisonking.dev",
    "phone": "801-860-0773",
    "address":{
      "street": "",
      "city":"Salt Lake City,",
      "state":"Utah",
      "zip": ""
    },
    "website": "http://www.harrisonking.dev",
    "resumedownload":"/resume",
    "social":[
      {
        "name":"linkedin",
        "url":"www.linkedin.com/in/harrison-king-dev",
        "className":"fa fa-linkedin"
      },
      {
        "name":"github",
        "url":"https://github.com/Gobsmack90",
        "className":"fa fa-github"
      },
      {
        "name":"freeCodeCamp",
        "url":"https://www.freecodecamp.org/gobsmack",
        "className":"fa fa-code"
      }
    ]
  },
  "resume":{
    "skillmessage":"While most of my focus thus far has been on front end development, I am able to work on the back-end. I'm studying and working on both sides of development all the time to increase my skills and shore up my shortcomings.",
    "education":[
      {
        "school":"University of Utah",
        "degree":"Bachelor of Arts, Film and Media Arts",
        "graduated":"December 2016",
        "description":"My focus at school was on screenwriting and editing. I learned how to take disparate elements and make a story out of them. I've taken those skills with me into my programming. I have a vision of what I want, and know what elements are needed to accomplish that vision."
      }
    ],
    "work":[
      {
        "company":"TBDG",
        "title":"Freelance Developer",
        "years":"Dec 2020 - Present",
        "description":"I've been doing some freelance Web Dev with a team of friends. I've mostly been programming in React and working on front end stuff in the projects we've worked on together."
      },
      {
        "company":"Teck Advanced Materials",
        "title":"Material Technician ",
        "years":"Jan 2017 - Present",
        "description":"I work with copper, tin and other metals. We purify, clean, mold and prep metals for electronics manufacturing."
      },
      {
        "company":"TMRW Productions",
        "title":"Editor/Content Director",
        "years":"Jan 2016 - May 2017",
        "description":"Made professional videos for companies. Worked on set, in pre-production, and edited. Also had a role in sales."
      },
      {
        "company":"Wasatch Savings",
        "title":"Account Rep",
        "years":"Jun 2014 - Sep 2016",
        "description":"Recruited and worked with businesses to put them in the Wasatch Savings Guide, a school fundraiser deals book."
      }
    ],
    "skills":[
      {
        "name":"ReactJs",
        "level":"80%"
      },
      {
        "name":"JavaScript",
        "level":"90%"
      },
      {
        "name":"CSS",
        "level":"70%"
      },
      {
        "name":"HTML5",
        "level":"70%"
      },
      {
        "name":"Express",
        "level":"40%"
      },
      {
        "name":"MongoDB",
        "level":"50%"
      },
      {
        "name":"NodeJS",
        "level":"60%"
      },
      {
        "name":"Git",
        "level":"60%"
      },
      {
        "name":"JQuery",
        "level":"40%"
      },
      {
        "name":"Common Front End Libraries, incl. Bootstrap, Sass, Redux",
        "level":"70%"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"Our Fish Collective",
        "category":"Participating in a rebuild of this website. We're adding a better multivendor setup to the site.",
        "details": "(Note: our rebuild is not yet live. This is an ongoing project that started in March 2021.) The primary goal of this rebuild is to allow individual venders to add thier own products without needing to go through the website admin. To this end, we're reconstructing everything in the site. Up to now, I've mainly been involved in the front end side of things. So far, I've built the Footer and Recently Added components.",
        "image":"ofc_rebuild.png",
        "url":"https://www.ourfishcollective.com/",
        "github":"https://github.com/TBDG/ofc-front-end"
      },
      {
        "title":"The Waterfront",
        "category":"A minor website rebuild my team was hired to work on.",
        "details": "The same person who hired us for the Our Fish Collective project, first hired us to work on this. We were supposed to add a store to the site, but we were asked to switch focus to Our Fish Collective, and so only a front page is live right now. This site is completely mobile responsive. I built several of the sections on this front page: the footer, landing, testimonials, and location components.",
        "image":"theWaterfront.png",
        "url":"https://thewaterfrontslc.com/",
        "github":"https://github.com/TBDG/waterfront"
      },
      {
        "title":"Minecraft Node Wrapper",
        "category":"A project which uses MongoDB to add new functionality to Minecraft.",
        "details": "This project was started with the intent to add some quality-of-life and social features to Minecraft without modding the game itself. We use the built-in minecraft commands and a mongoDB database to give players added functionality. Players can set a home that they can teleport to, warp to other players, store and retrieve experience, and more. I contributed a great deal to this project. I added a cooldown feature, the xp storing features, the customizable welcome message, a way to share homes with players, and more.",
        "image":"Minecraft-Node-Wrapper.png",
        "url":"https://youtu.be/69kquZaVZqg",
        "github":"https://github.com/JoshuaBaert/mc-node-wrapper"
      },
      {
        "title":"React 21",
        "category":"A primitive blackjack app built in React.",
        "details": "The react portion of this app was built fairly early in my career and I've just now given it a css facelift to make it more presentable. I would have preferred to use Bootstrap and more Sass features in this. However, because it is hosted as a component of this portfolio, the way the template is set up made it so that would require more effort than is worth it. Note: The github link is for my entire portfolio, which also contains the code for this app. In the readme you can see what parts of this portfolio are additions I've made to the template.",
        "image":"react21.png",
        "url":"/react21",
        "github":"https://github.com/Gobsmack90/portfolio"
      },
      {
        "title":"Projects created for freeCodeCamp",
        "category":"See the projects I've completed for course credit.",
        "details": "Much of my programming experience comes in the form of completing assignments for freeCodeCamp. I don't view those porjects as sufficient quality to showcase in this portfolio, but I present them here to make them available to any who'd like to see more.",
        "image":"freeCodeCamp-profile.png",
        "url":"https://www.freecodecamp.org/gobsmack",
        "github":"https://github.com/Gobsmack90"
      }
    ]
  },
  "testimonials":{
    "testimonials":[
      {
        "text":"Harrison has been surprisingly quick at learning hard subjects, and very resilient when hitting road blocks. He has found unexpected and undesirable behavior on apps and worked to correct them. Harrison holds himself very professionally, It was easy to trust him to directly communicate to a client. I think he would prove to be a very valuable resource for any team that would work with him.",
        "user":"Josh Baert: TDBG Owner, Senior Developer and Mentor"
      },
      {
        "text":"Harrison has worked with me for the past four years. Over that time, I have seen him grow as a person and employee. We work in a fast-paced environment where thinking critically and quickly is a necessary skill. Over the time that Harrison was employed at Teck Advanced Materials, I saw these skills grow into a part of his daily work life. I would highly recommend Harrison. He is a quick learner and is great at following directions.",
        "user":"Colby Higginson: Manager at Teck Advanced Materials"
      }
    ]
  }
}
